[
  {
    "title": "Thanks everyone for a great semester!!",
    "date": "12/12/25",
    "preview": "Hey everyone!I just wanted to thank you all for an amazing class. There were definitely some growing pains as we worked"
  },
  {
    "title": "Colab Pro Reimbursement Instructions [December 10 deadline]",
    "date": "12/2/25",
    "preview": "Howdy gang, if you weren't able to aquire the free google colab pro credits through your student email, here's informati"
  },
  {
    "title": "Final Project submission available on gradescope",
    "date": "12/2/25",
    "preview": "Hi all, You should now be able to upload your final projects to Gradescope. Please follow the submission instructions p, 1 Unresolved followup"
  },
  {
    "title": "One extra slip day! (for HWs)",
    "date": "11/14/25",
    "preview": "Howdy y'all, To try and help manage stress, we've decided to blanket grant one additional slip day to everyone, bringin"
  },
  {
    "title": "Maximum grade cutoffs",
    "date": "11/8/25",
    "preview": "Hello everyone!&nbsp; We can't commit at this point to specific cutoffs for course grades, but as discussed we have agr"
  },
  {
    "title": "Exemplary Past Final Projects posted on Canvas",
    "date": "11/7/25",
    "preview": "Hi everybody! Several people have asked for examples of what good final projects look like. With their permission, I hav"
  },
  {
    "title": "Midterm grades released",
    "date": "10/30/25",
    "preview": "Hi everyone, The midterms have been graded, and you can find your scores for both the multiple-choice and short answer c"
  },
  {
    "title": "Final Project Guidelines released",
    "date": "10/14/25",
    "preview": "Hi everyone, As we move into the second half of the semester, it is time to start thinking about your final project. W"
  },
  {
    "title": "Good News! Free Colab Pro Credits for Students",
    "date": "9/13/25",
    "preview": "Google is currently offering 100 free credits per month of Colab Pro for new student users. For context, using their A10"
  },
  {
    "title": "Office Hours Calendar",
    "date": "9/12/25",
    "preview": "We've made a Google calendar for office hours (link to the calendar), please refer to this calendar for the most recent"
  },
  {
    "title": "Search for Teammates!",
    "date": "8/29/25,",
    "preview": ""
  },
  {
    "title": "6.7960 Project Submission",
    "date": "Friday",
    "preview": "Hi, I wanted to checkup on my project submission to ensure its ok. When i download the submission zip and render it out"
  },
  {
    "title": "Why Reduce Batch Size to Address Loss Spikes?",
    "date": "Thursday",
    "preview": "In Lecture 21 (Applications) taught by Prof. He, I noticed on slide 45 that one of the suggested remedies for addressing"
  },
  {
    "title": "Regrade Request HW 4",
    "date": "Thursday",
    "preview": "Hi, I realized that my regrade request for question 8c on PSET 4 never went through - I apologize for reaching out throu"
  },
  {
    "title": "Final project AI use statement",
    "date": "Wednesday",
    "preview": "Hi! I checked my submission in Gradescope again this morning and realized I didn't include a note on how I used generati"
  },
  {
    "title": "Missing Deadline on Project",
    "date": "Wednesday",
    "preview": "My team had an issue submitting our file at the last minute. We didn't realize that some necessary files were spread acr"
  },
  {
    "title": "Submitted Final Project 20 min late",
    "date": "Wednesday",
    "preview": "Hi! I submitted my final project on time, but I initially uploaded it in Markdown format and later realized that HTML wa"
  },
  {
    "title": "Late Submission",
    "date": "Wednesday",
    "preview": "There appears to be a 2h late submission on Gradescope for the final project. Is it valid and can we use it?"
  },
  {
    "title": "Is this okay?",
    "date": "Wednesday",
    "preview": "When we submitted, we got this as the preview on gradescope. I just wanted to ask if this is happening to anyone else, a"
  },
  {
    "title": "Question About HTML File Image Rendering",
    "date": "Wednesday",
    "preview": "Dear 6.7960 instructors, I just submitted my final project on gradescope. However, when I download my HTML file from gr"
  },
  {
    "title": "Pictures in Blogs (submission technical logistics)",
    "date": "Wednesday",
    "preview": "My group is submitting our blog, but we have some folders with images. The images can't be shown in the blog (they have"
  },
  {
    "title": "Project deadline 2 am?",
    "date": "Wednesday",
    "preview": "Good evening, We had and have to spontaneously restructure our report because we weren't able to achieve the results we"
  },
  {
    "title": "Submission",
    "date": "Wednesday",
    "preview": "Hi all, I have successfully uploaded my final project to the gradescope, but for some reason it keeps unzipping my proj"
  },
  {
    "title": "Uploading Final Project -- zip file too big",
    "date": "Wednesday",
    "preview": "I have a video that I want to include in my blog and because of this, the size of the .zip file is around 200MB and cann"
  },
  {
    "title": "blog zip file submission",
    "date": "Wednesday",
    "preview": "When submitting the zip file, gradescope automatically unzips it... Is there a way to prevent it from doing that? Altern"
  },
  {
    "title": "Model runs keep getting preempted; request for extension -- ldhuang",
    "date": "Wednesday",
    "preview": "Hello, I hope you are doing well. Our team has some very promising results (attached in image), but when we try to run a"
  },
  {
    "title": "6.7960 Rubric -- Hypothesis",
    "date": "Tuesday",
    "preview": "In the rubric for the project, it says that the project should have a hypothesis that's clearly stated. What is the hypo"
  },
  {
    "title": "last due date on Gradescope",
    "date": "Tuesday",
    "preview": "The project last due date is at 2AM. Is this by design? If somehow we are forced to use this time are we penalized?"
  },
  {
    "title": "Including Data used",
    "date": "Tuesday",
    "preview": "For our final project, we generated data and included the functions for how we did so.&nbsp;Do we still need to include"
  },
  {
    "title": "zip won&#39;t upload",
    "date": "Tuesday",
    "preview": "Gradescope crashes when we upload our zip to gradescope. Can we use the github repo submission instead? That is proving"
  },
  {
    "title": "Late deadline for project?",
    "date": "Tuesday",
    "preview": "I notice that the late deadline is at 2am. Since, I assume, no one will actually start grading at 2am would it be alrigh"
  },
  {
    "title": "Overlap between 6.7960 and 6.C51",
    "date": "Tuesday",
    "preview": "I'm interested in taking 6.C51 and 1.C51 next semester. I'm curious if the teaching staff has any thoughts on the overla"
  },
  {
    "title": "illustrative figure",
    "date": "Tuesday",
    "preview": "for the limit of 4-6 figures, what if we want to include additional figures like for illustrative purpose (and it's not"
  },
  {
    "title": "Final Project Team Submission",
    "date": "Tuesday",
    "preview": "Hi, just to confirm for group projects: should only one person from the team submit the single .zip file on Gradescope,"
  },
  {
    "title": "Blog Post Word Count and Figure Count",
    "date": "Monday",
    "preview": "Hi! I'm wondering if it is ok if our blog post has &gt;6 figures and/or &gt;3000 words, or if we will be penalized for"
  },
  {
    "title": "Gradescope Project Submission",
    "date": "Monday",
    "preview": "I was able to submit my Final Project to Gradescope as a .zip file, but when I tried to download my submission from Grad"
  },
  {
    "title": "No OH next Monday (Dec 8) due to NeurIPS",
    "date": "Sunday,",
    "preview": ""
  },
  {
    "title": "Code submission guidelines",
    "date": "Sunday",
    "preview": "How should we give the code for the final project? Is it okay to just include it in the final zip with the html file? th"
  },
  {
    "title": "Are you expected to submit our code for the final project?",
    "date": "Sunday",
    "preview": "Are we expected to somehow submit / provide our code for the final project? Thank you!, 1 Unresolved followup"
  },
  {
    "title": "Blog post question",
    "date": "Sunday",
    "preview": "Should the blog post or the zip file somehow&nbsp;include: -a statement on how we used AI -and our code? if yes, where"
  },
  {
    "title": "Blog Post",
    "date": "Sunday",
    "preview": "Hi! I was wondering what the extent of distracting from the content of the paper is when writing the blog post. Can you"
  },
  {
    "title": "Quality of Topic",
    "date": "Sunday",
    "preview": "Hello, I was wondering my team's (a team of 3) research proposal meets the standards of the rubric (especially novelty a"
  },
  {
    "title": "Pset regrade",
    "date": "12/6/25",
    "preview": "Hello, I just got back my regrade request for Pset 3 problem 2b. It seems the grader / re-grader did not look at all of"
  },
  {
    "title": "HW 4 Grade Statistics (Note regrade policy)",
    "date": "12/5/25",
    "preview": "Howdy howdy!Apologies for the delay, Pset 4 grades have now been posted. Great job and good luck on your final projects!"
  },
  {
    "title": "Final Project Figures",
    "date": "12/5/25",
    "preview": "Can the figures in our project have subfigures? We're looking at the examples and it seems like there were more pictures"
  },
  {
    "title": "Project Pivot Feedback",
    "date": "12/4/25",
    "preview": "Hi Professors and TAs, I was originally working on a different idea for my 6.7960 final project, but after completing a"
  },
  {
    "title": "Appendix Information",
    "date": "12/4/25",
    "preview": "Hi! Does appendix information count towards the word and figure count? I reference the appendix a few times in my blog a"
  },
  {
    "title": "Project Update and Missing Project Breaks",
    "date": "12/4/25",
    "preview": "Dear Instructor Team, &nbsp; My partner Eunice Choi and I are writing to update you on our final project, as we were unf"
  },
  {
    "title": "Image Datasets",
    "date": "12/4/25",
    "preview": "Besides CIFAR and MNIST are they any publicly available image datasets that we can easily use? It seems ImageNet require, 2 Unresolved followups"
  },
  {
    "title": "Project Office Hours tomorrow during class time (and at 9am)",
    "date": "12/4/25",
    "preview": "Tomorrow, instead of going physically to class, we'll be virtually holding an extra&nbsp;project office hour from 1pm to"
  },
  {
    "title": "Thur Dec 4th OH plan",
    "date": "12/4/25",
    "preview": "How does office hour during class tomorrow work? Will we all be put into one zoom lobby with TA and professors then get"
  },
  {
    "title": "Sanity check for our Music VAE project",
    "date": "12/4/25",
    "preview": "Hi there, &nbsp; Hope December has been going well for you all! For our final project, we’ve been trying to implement an"
  },
  {
    "title": "Final project gradescope expected autograder behavior",
    "date": "12/3/25",
    "preview": "Hi! I tried submitting my final project to gradescope and the autograder seems to be perpetually running in an infinite"
  },
  {
    "title": "PSET 4 &amp; 5 Grades",
    "date": "12/2/25",
    "preview": "When will the PSET 4 and 5 grades be released?&nbsp;"
  },
  {
    "title": "Are we supposed to submit the project on gradescope?",
    "date": "12/2/25",
    "preview": "If yes, could someone add the submission option on gradescope, please? Thanks!"
  },
  {
    "title": "Final Project Idea",
    "date": "12/1/25",
    "preview": "Hi, My group and I were starting implementing this project, but we wanted to run it through the instructors/TAs before"
  },
  {
    "title": "Writing blog post",
    "date": "11/30/25",
    "preview": "Is it necessary for the final project submission to be a blog post? Is it possible for it to be a word document? I under"
  },
  {
    "title": "Knowledge Distillation - Final Project Guidance",
    "date": "11/30/25",
    "preview": "My team and I are nailing out a project involving knowledge distillation and would like to consult TAs with strong backg"
  }
]